In [ ]:
 # Python extension for interfacing with SQL and better table formatting with Pandas

# !pip install ipython-sql
# !pip install pandas

Our data for this project is initially in 2 CSV file (the last question uses another dataset from the last project, DSIP #3, more work is done with that data in that project). Let's investigate how the new dataset looks like first.

In [2]:
# load the extensions that we need to begin a separate cell
import pandas as pd
import sqlite3

In [6]:
# Getting a view of the estate csv table
homes_df = pd.read_csv('home_value_data.csv')
print(homes_df.head())
print(homes_df.info())

# Also just getting the census data set up to combine into a new database
census_df = pd.read_csv('census_data.csv')

   zip_code     city state                     metro       county     date  \
0     60657  Chicago    IL  Chicago-Naperville-Elgin  Cook County  1996-04
1     60657  Chicago    IL  Chicago-Naperville-Elgin  Cook County  1996-05
2     60657  Chicago    IL  Chicago-Naperville-Elgin  Cook County  1996-06
3     60657  Chicago    IL  Chicago-Naperville-Elgin  Cook County  1996-07
4     60657  Chicago    IL  Chicago-Naperville-Elgin  Cook County  1996-08

      value
0  334200.0
1  335400.0
2  336500.0
3  337600.0
4  338500.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4202944 entries, 0 to 4202943
Data columns (total 7 columns):
 #   Column    Dtype
---  ------    -----
 0   zip_code  int64
 1   city      object
 2   state     object
 3   metro     object
 4   county    object
 5   date      object
 6   value     float64
dtypes: float64(1), int64(1), object(5)
memory usage: 224.5+ MB
None

Looks like this dataset contains the specific area we have the data for, the date of the data, plus the median estimated value for that area (we know that this is what value means based off of the description for the data).

We also don't really have a primary key for this dataset either. Although a composite key from the zip_code and date columns together should be unique.

In [7]:
# Combining tables and making SQL database

# Make the SQLite database
conn = sqlite3.connect('estate.db')

# Write DataFrames to SQLite tables in the database (don't need the dataframe indexes)
homes_df.to_sql('homes', conn, if_exists='replace', index=False)
census_df.to_sql('census', conn, if_exists='replace', index=False)

# Close the connection
conn.close()

In [8]:
# Necessary in the Jupyter Notebook to load the SQL extension and connect to the database file to use SQL directly, currently using SQLite
# Formatting the SQL query outputs into a better format with Pandas

%load_ext sql
%sql sqlite:///estate.db
%config SqlMagic.autopandas=True

Let's just take a look and see if the zip_code and date combined really are our composite key (even though we won't adjust the table for this at all, just for investigation purposes)

In [10]:
%%sql
SELECT zip_code, date, COUNT(*)
FROM homes
GROUP BY zip_code, date
HAVING COUNT(*) > 1;

 * sqlite:///estate.db
Done.

Empty DataFrame
Columns: []
Index: []

Since nothing got returned, we know there are no duplicate zip_code/date combinations and they can work as our composite key (although again, we won't be adjusting or making a primary key column based on this).

Let's also check and make sure our data types are correct.

In [12]:
%%sql 
PRAGMA table_info(homes);

 * sqlite:///estate.db
Done.

   cid      name     type  notnull dflt_value  pk
0    0  zip_code  INTEGER        0       None   0
1    1      city     TEXT        0       None   0
2    2     state     TEXT        0       None   0
3    3     metro     TEXT        0       None   0
4    4    county     TEXT        0       None   0
5    5      date     TEXT        0       None   0
6    6     value     REAL        0       None   0

Everything looks good so we can start with the questions

1. How many distinct zip codes are in this dataset?

In [14]:
%%sql
SELECT COUNT(DISTINCT zip_code) AS '# ZIP Codes'
FROM homes;

 * sqlite:///estate.db
Done.

   # ZIP Codes
0        15452

2. How many zip codes are from each state?

In [18]:
%%sql
SELECT state, COUNT(DISTINCT zip_code) AS '# ZIP Codes'
FROM homes
GROUP BY state;

 * sqlite:///estate.db
Done.

   state  # ZIP Codes
0     AK           28
1     AL          221
2     AR          119
3     AZ          233
4     CA         1230
5     CO          261
6     CT          122
7     DC           18
8     DE           39
9     FL          795
10    GA          375
11    HI           62
12    IA          223
13    ID          111
14    IL          571
15    IN          420
16    KS          242
17    KY          163
18    LA          195
19    MA          419
20    MD          322
21    ME           95
22    MI          547
23    MN          416
24    MO          326
25    MS          146
26    MT           72
27    NC          489
28    ND           33
29    NE           89
30    NH          198
31    NJ          501
32    NM           60
33    NV          101
34    NY         1081
35    OH          630
36    OK          230
37    OR          224
38    PA          875
39    RI           60
40    SC          215
41    SD           20
42    TN          436
43    TX          940
44    UT          121
45    VA          428
46    VT           62
47    WA          348
48    WI          426
49    WV           82
50    WY           32

3. What range of years are represented in the data?

In [40]:
%%sql
-- The date column is not in the correct format for the usual method of extracting just the year from a date
-- We can just extract the first part of the str though
SELECT DISTINCT SUBSTR(date, 1, 4) AS 'year'
FROM homes;

 * sqlite:///estate.db
Done.

    year
0   1996
1   1997
2   1998
3   1999
4   2000
5   2001
6   2002
7   2003
8   2004
9   2005
10  2006
11  2007
12  2008
13  2009
14  2010
15  2011
16  2012
17  2013
18  2014
19  2015
20  2016
21  2017
22  2018

4. Using the most recent month of data available, what is the range of estimated home values across the nation?

In [29]:
%%sql
SELECT MAX(value), MIN(value), AVG(value)
FROM homes
WHERE date = (
    SELECT date
    FROM homes
    ORDER BY date DESC
    LIMIT 1
);

 * sqlite:///estate.db
Done.

   MAX(value)  MIN(value)     AVG(value)
0  17757800.0     21600.0  290012.619726

5. Using the most recent month of data available, which states have the highest average home values? How about the lowest?

In [34]:
%%sql
SELECT state, ROUND(AVG(value), 2) AS 'Avg Value'
FROM homes
WHERE date = (
    SELECT date
    FROM homes
    ORDER BY date DESC
    LIMIT 1
)
GROUP BY state
ORDER BY 2 DESC;

 * sqlite:///estate.db
Done.

   state  Avg Value
0     DC  826572.22
1     CA  750965.37
2     HI  711085.48
3     MA  475926.97
4     CO  442713.03
5     WA  414104.60
6     NJ  403476.05
7     NY  378121.09
8     NV  349834.65
9     UT  343776.86
10    OR  335449.11
11    MD  332744.10
12    RI  323568.33
13    AK  322957.14
14    FL  298898.62
15    CT  293402.46
16    VA  285035.98
17    AZ  280860.52
18    NH  277524.24
19    ME  265288.42
20    ID  261025.23
21    DE  259938.46
22    MT  247658.33
23    WY  238309.38
24    NM  233565.00
25    VT  230911.29
26    MN  226873.08
27    IL  210954.82
28    TX  210329.57
29    GA  207821.60
30    SD  204150.00
31    SC  196123.72
32    WI  193712.44
33    NC  191436.20
34    PA  187596.80
35    ND  186442.42
36    NE  184194.38
37    MI  172427.61
38    MO  169915.34
39    IA  168169.96
40    KY  156955.83
41    TN  154909.63
42    AL  152780.54
43    OH  152599.37
44    LA  148747.18
45    KS  146699.59
46    IN  143075.24
47    AR  139538.66
48    WV  123968.29
49    MS  123058.22
50    OK  121545.65

6. Which states have the highest/lowest average home values for the year of 2017? What about for the year of 2007? 1997?

In [64]:
%%sql
SELECT state, SUBSTR(date, 1, 4) AS 'year', ROUND(AVG(value), 2) AS 'Avg Value'
FROM homes
WHERE year = '2017' OR year = '2007' OR year = '1997'
GROUP BY state, year
ORDER BY year DESC, 3 DESC;

 * sqlite:///estate.db
Done.

    state  year  Avg Value
0      DC  2017  778756.02
1      CA  2017  688609.97
2      HI  2017  653451.75
3      MA  2017  438244.63
4      CO  2017  394511.46
..    ...   ...        ...
148    LA  1997   69803.65
149    TN  1997   68213.77
150    SD  1997   59295.00
151    OK  1997   56325.62
152    ND  1997        NaN

[153 rows x 3 columns]

Took a bit of a different approach to the question, combined the different sub questions into 1 table and just gave all the states. The ordering makes it so each year is separated and then within those years the states are ordered by their average value.

7. What is the percent change in average home values from 2007 to 2017 by state? How about from 1997 to 2017?

In [84]:
%%sql
WITH avg_2007 AS (
    SELECT state, SUBSTR(date, 1, 4) AS year, ROUND(AVG(value), 2) AS '2007avg'
    FROM homes
    WHERE year = '2007'
    GROUP BY state
),
avg_2017 AS (
    SELECT state, SUBSTR(date, 1, 4) AS year, ROUND(AVG(value), 2) AS '2017avg'
    FROM homes
    WHERE year = '2017'
    GROUP BY state
)
-- Need to use "" here to make sure it uses the column alias properly
SELECT avg_2007.state, "2007avg", "2017avg", 
    (( "2017avg" - "2007avg" ) / "2007avg") * 100 AS 'Percent Change'
FROM avg_2007
JOIN avg_2017 ON avg_2007.state = avg_2017.state
ORDER BY 4 DESC;

 * sqlite:///estate.db
Done.

   state    2007avg    2017avg  Percent Change
0     ND  124564.08  183148.99       47.031945
1     DC  599893.98  778756.02       29.815608
2     SD  143045.61  184605.42       29.053538
3     TX  152363.82  192054.76       26.050108
4     CO  313130.90  394511.46       25.989310
5     OK   91773.39  112451.70       22.531923
6     IA  128333.03  156758.26       22.149582
7     NE  137831.83  166257.87       20.623712
8     TN  117068.67  138124.43       17.985820
9     WA  316000.91  369567.15       16.951293
10    MA  377822.66  438244.63       15.992151
11    UT  254423.06  294948.76       15.928470
12    AK  275928.87  318021.43       15.254859
13    CA  598141.04  688609.97       15.125016
14    KY  126206.01  143375.72       13.604511
15    NY  318182.44  359342.49       12.935990
16    OR  275055.33  306799.07       11.540856
17    LA  129153.11  142874.70       10.624282
18    WY  202277.08  222159.90        9.829497
19    HI  611893.93  653451.75        6.791671
20    AR  120089.75  128088.31        6.660485
21    ID  210176.45  223306.91        6.247351
22    MI  146659.44  155352.13        5.927126
23    OH  131262.94  138364.51        5.410187
24    WV  112406.01  118281.61        5.227123
25    WI  169244.15  176782.43        4.454086
26    MN  199287.95  207513.66        4.127550
27    ME  231709.80  240862.11        3.949902
28    IN  120574.49  125044.21        3.707020
29    MT  215423.50  221810.42        2.964820
30    NC  170933.84  174062.83        1.830527
31    GA  182825.09  184896.80        1.133165
32    MO  151943.81  153369.20        0.938103
33    NH  254791.45  252847.10       -0.763114
34    PA  176372.29  174637.41       -0.983647
35    SC  180254.11  176363.72       -2.158281
36    VT  224758.48  219629.97       -2.281787
37    VA  283551.94  269285.32       -5.031396
38    KS  144679.71  136451.00       -5.687536
39    AL  148621.43  139148.30       -6.374000
40    RI  322582.22  294574.86       -8.682239
41    NM  232761.79  212525.42       -8.694026
42    FL  299784.12  272582.98       -9.073576
43    MS  131843.64  115630.65      -12.297135
44    IL  230522.74  201485.96      -12.596059
45    AZ  295021.39  255581.97      -13.368326
46    NJ  440055.90  375706.84      -14.622929
47    MD  369100.47  314660.25      -14.749431
48    NV  354913.26  301538.53      -15.038810
49    CT  341385.11  280047.68      -17.967225
50    DE  304398.15  248462.39      -18.375854

In [85]:
%%sql
WITH avg_1997 AS (
    SELECT state, SUBSTR(date, 1, 4) AS year, ROUND(AVG(value), 2) AS '1997avg'
    FROM homes
    WHERE year = '1997'
    GROUP BY state
),
avg_2017 AS (
    SELECT state, SUBSTR(date, 1, 4) AS year, ROUND(AVG(value), 2) AS '2017avg'
    FROM homes
    WHERE year = '2017'
    GROUP BY state
)
-- Need to use "" here to make sure it uses the column alias properly
SELECT avg_1997.state, "1997avg", "2017avg", 
    (( "2017avg" - "1997avg" ) / "1997avg") * 100 AS 'Percent Change'
FROM avg_1997
JOIN avg_2017 ON avg_1997.state = avg_2017.state
ORDER BY 4 DESC;

 * sqlite:///estate.db
Done.

   state    1997avg    2017avg  Percent Change
0     DC  189769.44  778756.02      310.369562
1     CA  207479.51  688609.97      231.893000
2     SD   59295.00  184605.42      211.333873
3     HI  216377.12  653451.75      201.996694
4     NY  126348.63  359342.49      184.405529
5     MA  168343.61  438244.63      160.327452
6     CO  154106.44  394511.46      155.999334
7     FL  108010.50  272582.98      152.367112
8     WA  147066.59  369567.15      151.292391
9     ME   96941.37  240862.11      148.461632
10    AK  134421.13  318021.43      136.585892
11    RI  126419.31  294574.86      133.014134
12    OR  132921.59  306799.07      130.812067
13    NH  109703.39  252847.10      130.482486
14    MN   91002.40  207513.66      128.030975
15    VT   99300.00  219629.97      121.178218
16    VA  122760.53  269285.32      119.358225
17    MD  144904.11  314660.25      117.150673
18    ID  102877.86  223306.91      117.060221
19    NJ  175576.60  375706.84      113.984574
20    AZ  122682.65  255581.97      108.327722
21    IA   76168.14  156758.26      105.805551
22    LA   69803.65  142874.70      104.680844
23    TN   68213.77  138124.43      102.487606
24    OK   56325.62  112451.70       99.645738
25    SC   89122.47  176363.72       97.889174
26    DE  126937.00  248462.39       95.736775
27    PA   89577.67  174637.41       94.956410
28    NV  157095.79  301538.53       91.945647
29    NC   91369.82  174062.83       90.503637
30    GA   98839.32  184896.80       87.068062
31    UT  162484.05  294948.76       81.524747
32    NE   93304.28  166257.87       78.188900
33    AR   72332.22  128088.31       77.083339
34    CT  159184.02  280047.68       75.927006
35    KY   82019.24  143375.72       74.807423
36    TX  113221.74  192054.76       69.627105
37    WV   69983.47  118281.61       69.013640
38    WY  135059.57  222159.90       64.490306
39    IL  123320.01  201485.96       63.384645
40    WI  111299.37  176782.43       58.835068
41    MO   97086.51  153369.20       57.971689
42    MI   99656.75  155352.13       55.887213
43    AL   89567.68  139148.30       55.355481
44    KS   88037.43  136451.00       54.992030
45    NM  139284.75  212525.42       52.583409
46    OH   92003.07  138364.51       50.391188
47    IN   87203.90  125044.21       43.392910
48    MT  157241.50  221810.42       41.063536
49    MS   86224.88  115630.65       34.103579
50    ND        NaN  183148.99             NaN

8. How would you describe the trend in home values for each state from 1997 to 2017? How about from 2007 to 2017? Which states would you recommend for making real estate investments?

The queries from the last question can be used to answer this question


From 1997-2017, all states had the average values increase (inflation). Only a few states had a huge increase, especially DC which was a lot higher than all the others.

From 2007-2017, there wasn't that much of an increase in the average values. In many states, the average actually decreases, or barely increases. ND was the one that had the biggest increase instead of DC (although that was second). ND may have had a big improvement from 1997 to 2017 but we can't see since we don't have data from there in 1997, although could just do from 1998.

For a recommendation DC or SD would be great choices as they have a strong history of going up in value that is still strong with the recent data in this dataset. CA, despite having a big increase from 1997-2017, has decrease recently.

9. Join the house value data with the table of zip-code level census data. Do there seem to be any correlations between the estimated house values and characteristics of the area, such as population count or median household income?

In [115]:
%%sql
-- Here the zip codes are being put into groups based on the average value of estates over the years 
-- The higher the average, the higher # bucket
WITH buckets AS (
    SELECT zip_code, 
        ROUND(AVG(value), 2) AS "zip_avg",
        NTILE(5) OVER (ORDER BY ROUND(AVG(value), 2) ASC) AS 'avg_bucket'
    FROM homes
    GROUP BY zip_code
)
-- Per each bucket (from the estate averages in the zip), calculate the averages within that bucket
SELECT avg_bucket AS 'Estate Value Bucket', ROUND(AVG(zip_avg), 2) AS 'Average Estate Value', ROUND(AVG(pop_total), 2) AS 'Average Population', ROUND(AVG(median_household_income), 2) AS 'Average Median Income'
FROM buckets
JOIN census ON buckets.zip_code = census.zip_code
GROUP BY avg_bucket;

 * sqlite:///estate.db
Done.

,Estate Value Bucket,Average Estate Value,Average Population,Average Median Income
0,1,71716.02,10986.33,42025.04
1,2,110142.58,14943.55,50365.56
2,3,148897.96,17828.57,57763.97
3,4,212056.63,20381.72,68882.57
4,5,475980.36,23422.51,89825.01

We can see that when the average estate value in a zip code increases, it is direcly proportional to both the average population in that area and the average income in that area too.
This does make sense, if a place costs more to live there, people's income needs to be higher. Plus, cities tend to cost more as well and will have a higher population.